micro-services/warp-web-sockets/load_test/config.yml
  config:
    target: "http://localhost:3030/"
    processor: "./wss-func/func.js"
    phases:
      - duration: 60
        arrivalRate: 150
  scenarios:
    - flow:
        - function: "generateRandomData"
        - post:
            url: "http://localhost:3030/register"
            json:
              name: "{{ name }}"
            capture:
              json: "$.uuid"
              as: uuid