micro-services/warp-web-sockets/load_test/config.yml
  config:
    target: "ws://localhost:3030/ws"
    processor: "./wss-func/func.js"
    phases:
      - duration: 50
        arrivalRate: 300
  scenarios:
    - engine: "ws"
      flow:
        - function: "createTimestampedObject"
        - send: "{{ data }}"
        - think: 5
        - send: "{{ data }}"